OpenNuvoton/M251BSP/Library/StdDriver/src/usci_uart.c
            if (u32Tmp > u32Tmp2)
            {
                u32ClkDiv = u32ClkDiv + 1UL;
            }
            else
            {
                u32Tmp2 = u32Tmp;
            }

            /* Record the closest solution */
            if (u32Tmp2 < u32Min)
            {
                u32Min = u32Tmp2;
                u32MinDSCnt = u32DSCnt;
                u32MinClkDiv = u32ClkDiv;

                /* Break when get good results */
                if (u32Min == 0UL)
                {
                    break;
                }
            }
        }
    }

    /* Disable USCI protocol */
    psUUART->CTL = 0UL;
    /* Enable USCI_UART protocol */
    psUUART->CTL = 2UL << UUART_CTL_FUNMODE_Pos;

    /* Set USCI_UART line configuration */
    psUUART->LINECTL = UUART_WORD_LEN_8 | UUART_LINECTL_LSB_Msk;
    psUUART->DATIN0 = (2UL << UUART_DATIN0_EDGEDET_Pos);  /* Set falling edge detection */

    /* Set USCI_UART baud rate */
    psUUART->BRGEN = ((u32MinClkDiv - 1UL) << UUART_BRGEN_CLKDIV_Pos) |
                     ((u32MinDSCnt - 1UL) << UUART_BRGEN_DSCNT_Pos) |
                     ((u32PDSCnt - 1UL) << UUART_BRGEN_PDSCNT_Pos);

    psUUART->PROTCTL |= UUART_PROTCTL_PROTEN_Msk;

    return (u32PCLKFreq / u32PDSCnt / u32MinDSCnt / u32MinClkDiv);
}


/**
 *    @brief        Read USCI_UART data
 *
 *    @param[in]    psUUART         The pointer of the specified USCI_UART module.
 *    @param[in]    pu8RxBuf        The buffer to receive the data of receive buffer.
 *    @param[in]    u32ReadBytes    The read bytes number of data.
 *
 *    @return       Receive byte count
 *
 *    @details      The function is used to read Rx data from RX buffer and the data will be stored in pu8RxBuf.
 */
uint32_t UUART_Read(const UUART_T *psUUART, uint8_t pu8RxBuf[], uint32_t u32ReadBytes)
{
    uint32_t  u32Count;

    for (u32Count = 0UL; u32Count < u32ReadBytes; u32Count++)
    {
        uint32_t u32Delayno = 0UL;

        while (psUUART->BUFSTS & UUART_BUFSTS_RXEMPTY_Msk)   /* Check RX empty => failed */
        {
            u32Delayno++;

            if (u32Delayno >= 0x40000000UL)
            {
                break;
            }
        }

        if (u32Delayno >= 0x40000000UL)
        {
            break;
        }

        pu8RxBuf[u32Count] = (uint8_t)psUUART->RXDAT;    /* Get Data from USCI RX  */
    }

    return u32Count;

}


/**
 *    @brief        Set USCI_UART line configuration
 *
 *    @param[in]    psUUART         The pointer of the specified USCI_UART module.
 *    @param[in]    u32Baudrate     The register value of baud rate of USCI_UART module.
 *                                  If u32Baudrate = 0, USCI_UART baud rate will not change.
 *    @param[in]    u32DataWidth    The data length of USCI_UART module.
 *                                  - \ref UUART_WORD_LEN_6
 *                                  - \ref UUART_WORD_LEN_7
 *                                  - \ref UUART_WORD_LEN_8
 *                                  - \ref UUART_WORD_LEN_9
 *    @param[in]    u32Parity       The parity setting (none/odd/even) of USCI_UART module.
 *                                  - \ref UUART_PARITY_NONE
 *                                  - \ref UUART_PARITY_ODD
 *                                  - \ref UUART_PARITY_EVEN
 *    @param[in]    u32StopBits     The stop bit length (1/2 bit) of USCI_UART module.
 *                                  - \ref UUART_STOP_BIT_1
 *                                  - \ref UUART_STOP_BIT_2
 *
 *    @return       Real baud rate of USCI_UART module.
 *
 *    @details      This function use to config USCI_UART line setting.
 */
uint32_t UUART_SetLine_Config(UUART_T *psUUART, uint32_t u32Baudrate, uint32_t u32DataWidth, uint32_t u32Parity, uint32_t u32StopBits)
{
    uint32_t u32PCLKFreq;
    uint32_t u32PDSCnt;
    uint32_t u32MinClkDiv = 0;
    uint32_t u32MinDSCnt = 0;

    /* Get PCLK frequency */
    if ((psUUART == UUART0) || (psUUART == UUART2))
    {
        u32PCLKFreq = CLK_GetPCLK0Freq();
    }
    else
    {
        u32PCLKFreq = CLK_GetPCLK1Freq();
    }

    if (u32Baudrate != 0UL)
    {
        uint32_t u32DSCnt;
        uint32_t u32Tmp;
        uint32_t u32Tmp2;
        uint32_t u32Tmp3;
        uint32_t u32Min;
        uint32_t u32Div;

        u32Div = u32PCLKFreq / u32Baudrate;
        u32Tmp = (u32PCLKFreq / u32Div) - u32Baudrate;
        u32Tmp2 = u32Baudrate - (u32PCLKFreq / (u32Div + 1UL));

        if (u32Tmp >= u32Tmp2)
        {
            u32Div = u32Div + 1UL;
        }

        u32Tmp = 0x400UL * 0x10UL;

        for (u32PDSCnt = 1UL; u32PDSCnt <= 0x04UL; u32PDSCnt++)
        {
            if (u32Div <= (u32Tmp * u32PDSCnt))
            {
                break;
            }
        }

        if (u32PDSCnt > 0x4UL)
        {
            u32PDSCnt = 0x4UL;
        }

        u32Tmp = u32Div / u32PDSCnt;
        u32Tmp2 = (u32Div / u32Tmp) - u32PDSCnt;
        u32Tmp3 = u32PDSCnt - (u32Div / (u32Tmp + 1UL));

        if (u32Tmp2 >= u32Tmp3)
        {
            u32Div = u32Tmp + 1UL;
        }
        else
        {
            u32Div = u32Tmp;
        }

        /* Find best solution */
        u32Min = (uint32_t) - 1;

        for (u32DSCnt = 6UL; u32DSCnt <= 0x10UL; u32DSCnt++)   /* DSCNT could be 0x5~0xF */
        {
            uint32_t u32ClkDiv = u32Div / u32DSCnt;
            uint32_t u32Tmp4 = u32PCLKFreq / (u32ClkDiv * u32DSCnt * u32PDSCnt);
            uint32_t u32Tmp5 = u32PCLKFreq / ((u32ClkDiv + 1UL) * u32DSCnt * u32PDSCnt);

            if (u32ClkDiv >= 0x400UL)
            {
                u32ClkDiv = 0x400UL;
                u32Tmp = abs((int)u32Tmp4 - (int)u32Baudrate);
                u32Tmp2 = u32Tmp;
            }
            else
            {
                u32Tmp = abs((int)u32Tmp4 - (int)u32Baudrate);
                u32Tmp2 = abs((int)u32Tmp5 - (int)u32Baudrate);
            }

            if (u32Tmp > u32Tmp2)
            {
                u32ClkDiv = u32ClkDiv + 1UL;
            }
            else
            {
                u32Tmp2 = u32Tmp;
            }

